app/controllers/songs_controller.rb

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 10]]
UPDATE "songs" SET "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["artist_id", 1], ["updated_at", "2017-12-16 17:01:12.812573"], ["id", 10]]
---
  def update
    @song = Song.find(params[:id])

    @song.update(song_params)